poiuy105/mmWave/sdkconfig.defaults
# LD Radar Web Monitor - 默认配置
# ESP32-C3 默认配置

# 目标芯片
CONFIG_IDF_TARGET="esp32c3"

# Flash 大小
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# 分区表
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# FATFS 配置
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y

# HTTP Server 配置
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_ERR_RESP_NO_DELAY=y
CONFIG_HTTPD_PURGE_BUF_LEN=128
CONFIG_HTTPD_WS_SUPPORT=y

# WiFi 配置
CONFIG_ESP_WIFI_AUTH_WPA_PSK=y
CONFIG_ESP_WIFI_AUTH_WPA2_PSK=y

# 系统配置
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=2048

# 日志级别
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL=3

# 组件配置
CONFIG_FREERTOS_HZ=100
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=2048

# 看门狗
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15

# 禁用不需要的功能以节省内存
CONFIG_MBEDTLS_HARDWARE_MPI=n
CONFIG_MBEDTLS_HARDWARE_SHA=n

# 雷达型号选择 - LD6004
CONFIG_RADAR_LD6004=y
CONFIG_RADAR_UART_TX_PIN=1
CONFIG_RADAR_UART_RX_PIN=0
# 使用默认波特率 115200
# CONFIG_RADAR_UART_BAUD_RATE 未设置，使用默认值
